## Installation steps:
- https://medium.com/@GalarnykMichael/install-spark-on-mac-pyspark-453f395f240b#.be80dcqat

## Import pyspark

In [1]:
import pyspark.sql.functions as F
import pyspark
from pyspark import SparkConf, SparkContext

# Create Spark Session

In [2]:
#pyspark.sql.SparkSession

spark = pyspark.sql.SparkSession.builder.master("local").appName("SparkByExamples.com").getOrCreate()

# Read csv file using spark

In [68]:
df1 = spark.read.option("header",True) \
     .csv("/Users/ravidevineni/PycharmProjects/project/emp_details.csv")

In [69]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  null|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1233|      hari|    haran|  9000|        1934| 43|
|  1240|      hari|    haran|  9000|        1934| 43|
|  1241|      hari|    haran|  9000|        1934| 43|
|  1251|      hari|    haran|  9100|        1934| 43|
|  1261|      hari|    haran|  9200|        1934| 43|
+------+----------+---------+------+------------+---+

In [70]:
df2 = spark.read.option("header",True) \
     .csv("/Users/ravidevineni/PycharmProjects/project/emp_department.csv")

# Show is used to visualize the data

In [71]:
df2.show()

+------+----------+
|emp_id|department|
+------+----------+
|  1234|     dept1|
|  1235|     dept2|
|  1236|     dept1|
|  1237|     dept2|
|  1238|     dept1|
|  1239|     dept1|
|  1233|     dept2|
|  1240|     dept1|
|  1241|     dept1|
|  1251|     dept1|
|  1261|     dept1|
+------+----------+

In [52]:
df1.dtypes

[('emp_id', 'string'),
 ('first_name', 'string'),
 ('last_name', 'string'),
 ('salary', 'string'),
 ('phone_number', 'string'),
 ('age', 'string')]

In [53]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  null|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1233|      hari|    haran|  9000|        1934| 43|
|  1240|      hari|    haran|  9000|        1934| 43|
|  1241|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

## first() will return the first row from the dataframe

In [166]:
df1.first()

Row(emp_id='1234', first_name='hari', last_name='kiran', salary='2000', phone_number='1234', age='20')

# take() will return particular records based on the argument it takes

In [167]:
df1.take(2)

[Row(emp_id='1234', first_name='hari', last_name='kiran', salary='2000', phone_number='1234', age='20'),
 Row(emp_id='1235', first_name='ravi', last_name='kumar', salary='3000', phone_number='1239', age='21')]

# Schema is used to return the schema of dataframe, which contains the column name, type of data inside each column

In [168]:
df1.schema

StructType([StructField('emp_id', StringType(), True), StructField('first_name', StringType(), True), StructField('last_name', StringType(), True), StructField('salary', StringType(), True), StructField('phone_number', StringType(), True), StructField('age', StringType(), True)])

# dropDuplicates is used to drop the duplicates

In [174]:
df_unique = df1.dropDuplicates()

In [175]:
df_unique.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1236|       sri|  krishna|  5000|        1434| 24|
+------+----------+---------+------+------------+---+

In [177]:
df_unique.select(df1["first_name"]).show()

+----------+
|first_name|
+----------+
|      hari|
|      ravi|
|    suresh|
|     rohit|
|      hari|
|       sri|
+----------+

In [181]:
df100 = df1.select(df1["first_name"],df1["last_name"],df1["age"]+ 10)

In [182]:
df101 = df1.select(df1["first_name"],df1["phone_number"],df1["age"]+ 10)

In [183]:
df101.collect()

[Row(first_name='hari', phone_number='1234', (age + 10)=30.0),
 Row(first_name='ravi', phone_number='1239', (age + 10)=31.0),
 Row(first_name='sri', phone_number='1434', (age + 10)=34.0),
 Row(first_name='rohit', phone_number='1539', (age + 10)=33.0),
 Row(first_name='suresh', phone_number='1639]', (age + 10)=49.0),
 Row(first_name='hari', phone_number='1934', (age + 10)=53.0),
 Row(first_name='hari', phone_number='1934', (age + 10)=53.0),
 Row(first_name='hari', phone_number='1934', (age + 10)=53.0)]

## Note: Spark is having lazy evaluation

# Filter the data with specific condition

In [110]:
df1.select(df1['age'] > 24).show()

+----------+
|(age > 24)|
+----------+
|     false|
|     false|
|     false|
|     false|
|      true|
|      true|
+----------+

In [186]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# Assign the values based on the particular copndition

In [184]:
 df1.select("first_name", F.when(df1.age > 30, 1).otherwise(0)).show()

+----------+--------------------------------------+
|first_name|CASE WHEN (age > 30) THEN 1 ELSE 0 END|
+----------+--------------------------------------+
|      hari|                                     0|
|      ravi|                                     0|
|       sri|                                     0|
|     rohit|                                     0|
|    suresh|                                     1|
|      hari|                                     1|
|      hari|                                     1|
|      hari|                                     1|
+----------+--------------------------------------+

In [188]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

In [194]:
 df1[df1.last_name.isin("haran")].dropDuplicates().show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

In [198]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# Like statement is used to verify the given data is matching with the condition

In [200]:
 df1.select("first_name", df1.last_name.like("%ma%")).show()

+----------+-------------------+
|first_name|last_name LIKE %ma%|
+----------+-------------------+
|      hari|              false|
|      ravi|               true|
|       sri|              false|
|     rohit|               true|
|    suresh|              false|
|      hari|              false|
|      hari|              false|
|      hari|              false|
+----------+-------------------+

In [203]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# startswith is used to check if the data inside specific column is starts with the string mentioned and return the respective boolean value

In [202]:
df1.select("first_name", 'age', df1.last_name.startswith("ha")).show()

+----------+---+-------------------------+
|first_name|age|startswith(last_name, ha)|
+----------+---+-------------------------+
|      hari| 20|                    false|
|      ravi| 21|                    false|
|       sri| 24|                    false|
|     rohit| 23|                    false|
|    suresh| 39|                    false|
|      hari| 43|                     true|
|      hari| 43|                     true|
|      hari| 43|                     true|
+----------+---+-------------------------+

# startswith is used to check if the data inside specific column is starts with the string mentioned and return the respective boolean value

In [204]:
 df1.select('last_name', df1.last_name.endswith("haran")).show()

+---------+--------------------------+
|last_name|endswith(last_name, haran)|
+---------+--------------------------+
|    kiran|                     false|
|    kumar|                     false|
|  krishna|                     false|
|   sharma|                     false|
|    raina|                     false|
|    haran|                      true|
|    haran|                      true|
|    haran|                      true|
+---------+--------------------------+

# Assigment: create employee data with columns first_name, last_name, emails (which contain gmail, outlook, etc). filter the employee data which have gmail.

- gmail endwith @gmail.com
- outlook endswith @outlook.com

# To get the substring from the data inside specific column. It takes the start and ending index of the substring

In [130]:
df1.select(df1.last_name.substr(1, 3).alias("name")).collect()

[Row(name='kir'),
 Row(name='kum'),
 Row(name='kri'),
 Row(name='sha'),
 Row(name='rai'),
 Row(name='har')]

In [205]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# between is used to get the records whichever the values are between the given limits

In [206]:
df1.select(df1.age.between(22, 24)).show(20)

+-----------------------------+
|((age >= 22) AND (age <= 24))|
+-----------------------------+
|                        false|
|                        false|
|                         true|
|                         true|
|                        false|
|                        false|
|                        false|
|                        false|
+-----------------------------+

In [133]:
df3 = df1.withColumnRenamed('last_name', 'LastName')

In [207]:
df3.show()

+------+----------+--------+------+------------+---+
|emp_id|first_name|LastName|salary|phone_number|age|
+------+----------+--------+------+------------+---+
|  1234|      hari|   kiran|  2000|        1234| 20|
|  1235|      ravi|   kumar|  3000|        1239| 21|
|  1236|       sri| krishna|  5000|        1434| 24|
|  1237|     rohit|  sharma|  6000|        1539| 23|
|  1238|    suresh|   raina|  8000|       1639]| 39|
|  1239|      hari|   haran|  9000|        1934| 43|
+------+----------+--------+------+------------+---+

# withColumnRenamed is used to change the column name, it takes two parameters: old and new column names

In [208]:
df103 = df1.withColumnRenamed('phone_number', 'mobile_number')

In [209]:
df103.show()

+------+----------+---------+------+-------------+---+
|emp_id|first_name|last_name|salary|mobile_number|age|
+------+----------+---------+------+-------------+---+
|  1234|      hari|    kiran|  2000|         1234| 20|
|  1235|      ravi|    kumar|  3000|         1239| 21|
|  1236|       sri|  krishna|  5000|         1434| 24|
|  1237|     rohit|   sharma|  6000|         1539| 23|
|  1238|    suresh|    raina|  8000|        1639]| 39|
|  1239|      hari|    haran|  9000|         1934| 43|
|  1239|      hari|    haran|  9000|         1934| 43|
|  1239|      hari|    haran|  9000|         1934| 43|
+------+----------+---------+------+-------------+---+

# drop function is used to drop the specific columns from the dataframe

In [212]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

In [213]:
 df4 = df1.drop("age")

In [214]:
df4.show()

+------+----------+---------+------+------------+
|emp_id|first_name|last_name|salary|phone_number|
+------+----------+---------+------+------------+
|  1234|      hari|    kiran|  2000|        1234|
|  1235|      ravi|    kumar|  3000|        1239|
|  1236|       sri|  krishna|  5000|        1434|
|  1237|     rohit|   sharma|  6000|        1539|
|  1238|    suresh|    raina|  8000|       1639]|
|  1239|      hari|    haran|  9000|        1934|
|  1239|      hari|    haran|  9000|        1934|
|  1239|      hari|    haran|  9000|        1934|
+------+----------+---------+------+------------+

# describe is used to get the arithemetic operations/aggregations on the data

In [137]:
df4.describe().show()

+-------+------------------+----------+---------+------------------+-----------------+
|summary|            emp_id|first_name|last_name|            salary|     phone_number|
+-------+------------------+----------+---------+------------------+-----------------+
|  count|                 6|         6|        6|                 6|                6|
|   mean|            1236.5|      null|     null|            5500.0|           1476.0|
| stddev|1.8708286933869707|      null|     null|2738.6127875258308|287.3282095444163|
|    min|              1234|      hari|    haran|              2000|             1234|
|    max|              1239|    suresh|   sharma|              9000|             1934|
+-------+------------------+----------+---------+------------------+-----------------+

# columns is used to get the column names of the given dataframe

In [138]:
df1.columns

['emp_id', 'first_name', 'last_name', 'salary', 'phone_number', 'age']

# count is used to get the number of records inside the dataframe

In [215]:
df1.count()

8

# distinct is used to get the unique records from the given dataframe

In [218]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

In [219]:
 df104 = df1.distinct()

In [220]:
df104.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1236|       sri|  krishna|  5000|        1434| 24|
+------+----------+---------+------+------------+---+

In [217]:
 df1.distinct().count()

6

# printSchema is used to get the schema of the given dataframe which contains the column name, the data type

In [141]:
 df1.printSchema()

root
 |-- emp_id: string (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- phone_number: string (nullable = true)
 |-- age: string (nullable = true)

# explain is used to get the physical and logocal plan of the dataframe

In [221]:
 df1.explain()

== Physical Plan ==
FileScan csv [emp_id#2783,first_name#2784,last_name#2785,salary#2786,phone_number#2787,age#2788] Batched: false, DataFilters: [], Format: CSV, Location: InMemoryFileIndex(1 paths)[file:/Users/ravidevineni/PycharmProjects/project/emp_details.csv], PartitionFilters: [], PushedFilters: [], ReadSchema: struct<emp_id:string,first_name:string,last_name:string,salary:string,phone_number:string,age:str...

# groupBy is used to group the data of specific columns to apply the aggregations

In [223]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

In [224]:
df1.groupBy("age").count().show()

+---+-----+
|age|count|
+---+-----+
| 43|    3|
| 23|    1|
| 24|    1|
| 20|    1|
| 39|    1|
| 21|    1|
+---+-----+

In [226]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# filter is used to filter the data based on specific condition

In [227]:
df1.filter(df1["age"]>24).show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# sort is used to sort the data based on specific columns, default is ascending order

In [229]:
 df1.sort(df1.age.desc()).collect()

[Row(emp_id='1239', first_name='hari', last_name='haran', salary='9000', phone_number='1934', age='43'),
 Row(emp_id='1239', first_name='hari', last_name='haran', salary='9000', phone_number='1934', age='43'),
 Row(emp_id='1239', first_name='hari', last_name='haran', salary='9000', phone_number='1934', age='43'),
 Row(emp_id='1238', first_name='suresh', last_name='raina', salary='8000', phone_number='1639]', age='39'),
 Row(emp_id='1236', first_name='sri', last_name='krishna', salary='5000', phone_number='1434', age='24'),
 Row(emp_id='1237', first_name='rohit', last_name='sharma', salary='6000', phone_number='1539', age='23'),
 Row(emp_id='1235', first_name='ravi', last_name='kumar', salary='3000', phone_number='1239', age='21'),
 Row(emp_id='1234', first_name='hari', last_name='kiran', salary='2000', phone_number='1234', age='20')]

In [231]:
df1.sort("age", ascending=True).show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# Assigment: Read the difference between show and collect

In [233]:
df105 = spark.read.option("header",True) \
     .csv("/Users/ravidevineni/PycharmProjects/project/emp_details.csv")

In [234]:
df105.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  null|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

# na.fill or fillna is used to fill the null values of a dataframe with specific value

In [246]:
df105.select('salary').na.fill(value='50', subset=None).show()

+------+
|salary|
+------+
|  2000|
|  3000|
|  5000|
|  6000|
|  8000|
|    50|
|  9000|
|  9000|
+------+

# na.drop() will be used to drop the null values from the dataframe

In [237]:
df105.na.drop().show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

## Tomorrow:
- joins
- udf
- window functions
- repartion and coalesce

In [7]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  null|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
+------+----------+---------+------+------------+---+

In [8]:
df2.show()

+------+----------+
|emp_id|department|
+------+----------+
|  1234|     dept1|
|  1235|     dept2|
|  1236|     dept1|
|  1237|     dept2|
|  1238|     dept1|
|  1239|     dept1|
+------+----------+

In [92]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  null|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1233|      hari|    haran|  9000|        1934| 43|
|  1240|      hari|    haran|  9000|        1934| 43|
|  1241|      hari|    haran|  9000|        1934| 43|
|  1251|      hari|    haran|  9100|        1934| 43|
|  1261|      hari|    haran|  9200|        1934| 43|
+------+----------+---------+------+------------+---+

In [93]:
df2.show()

+------+----------+
|emp_id|department|
+------+----------+
|  1234|     dept1|
|  1235|     dept2|
|  1236|     dept1|
|  1237|     dept2|
|  1238|     dept1|
|  1239|     dept1|
|  1233|     dept2|
|  1240|     dept1|
|  1241|     dept1|
|  1251|     dept1|
|  1261|     dept1|
+------+----------+

## Joins

In [97]:

df3 = df1.join(df2,df1.emp_id ==  df2.emp_id,"inner")

In [98]:
df3.show()

+------+----------+---------+------+------------+---+------+----------+
|emp_id|first_name|last_name|salary|phone_number|age|emp_id|department|
+------+----------+---------+------+------------+---+------+----------+
|  1234|      hari|    kiran|  2000|        1234| 20|  1234|     dept1|
|  1235|      ravi|    kumar|  3000|        1239| 21|  1235|     dept2|
|  1236|       sri|  krishna|  5000|        1434| 24|  1236|     dept1|
|  1237|     rohit|   sharma|  6000|        1539| 23|  1237|     dept2|
|  1238|    suresh|    raina|  8000|       1639]| 39|  1238|     dept1|
|  1239|      hari|    haran|  null|        1934| 43|  1239|     dept1|
|  1239|      hari|    haran|  9000|        1934| 43|  1239|     dept1|
|  1233|      hari|    haran|  9000|        1934| 43|  1233|     dept2|
|  1240|      hari|    haran|  9000|        1934| 43|  1240|     dept1|
|  1241|      hari|    haran|  9000|        1934| 43|  1241|     dept1|
|  1251|      hari|    haran|  9100|        1934| 43|  1251|     dept1|
|  1261|      hari|    haran|  9200|        1934| 43|  1261|     dept1|
+------+----------+---------+------+------------+---+------+----------+

In [105]:

df4 = df1.join(df2,df1.emp_id ==  df2.emp_id,"rightouter") \
     .show(truncate=False)

+------+----------+---------+------+------------+---+------+----------+
|emp_id|first_name|last_name|salary|phone_number|age|emp_id|department|
+------+----------+---------+------+------------+---+------+----------+
|1234  |hari      |kiran    |2000  |1234        |20 |1234  |dept1     |
|1235  |ravi      |kumar    |3000  |1239        |21 |1235  |dept2     |
|1236  |sri       |krishna  |5000  |1434        |24 |1236  |dept1     |
|1237  |rohit     |sharma   |6000  |1539        |23 |1237  |dept2     |
|1238  |suresh    |raina    |8000  |1639]       |39 |1238  |dept1     |
|1239  |hari      |haran    |9000  |1934        |43 |1239  |dept1     |
|1239  |hari      |haran    |null  |1934        |43 |1239  |dept1     |
|1233  |hari      |haran    |9000  |1934        |43 |1233  |dept2     |
|1240  |hari      |haran    |9000  |1934        |43 |1240  |dept1     |
|1241  |hari      |haran    |9000  |1934        |43 |1241  |dept1     |
|1251  |hari      |haran    |9100  |1934        |43 |1251  |dept1     |
|1261  |hari      |haran    |9200  |1934        |43 |1261  |dept1     |
+------+----------+---------+------+------------+---+------+----------+

In [103]:

d5 = df1.join(df2,df1.emp_id ==  df2.emp_id,"right")

## User defined functions

In [76]:
import pyspark.sql.types as T

In [161]:
@F.udf(T.IntegerType())
def age_adder(age):
    """
       add 1 to the age
    """
    return age+10

In [152]:
T.IntegerType()
def add_salary(salary):
    """
       add 1000 to the salary
    """
    return salary + 1000

In [ ]:
@F.udf(T.IntegerType())
def add_salary(salary):
    """
       add 1000 to the salary
    """
    return salary + 1000

In [153]:
import pyspark.sql.types as T

In [154]:
df7 = df1.withColumn("latest_salary", add_salary(F.col('salary')))

In [155]:
df7.show()

+------+----------+---------+------+------------+---+-------------+
|emp_id|first_name|last_name|salary|phone_number|age|latest_salary|
+------+----------+---------+------+------------+---+-------------+
|  1234|      hari|    kiran|  2000|        1234| 20|       3000.0|
|  1235|      ravi|    kumar|  3000|        1239| 21|       4000.0|
|  1236|       sri|  krishna|  5000|        1434| 24|       6000.0|
|  1237|     rohit|   sharma|  6000|        1539| 23|       7000.0|
|  1238|    suresh|    raina|  8000|       1639]| 39|       9000.0|
|  1239|      hari|    haran|  null|        1934| 43|         null|
|  1239|      hari|    haran|  9000|        1934| 43|      10000.0|
|  1233|      hari|    haran|  9000|        1934| 43|      10000.0|
|  1240|      hari|    haran|  9000|        1934| 43|      10000.0|
|  1241|      hari|    haran|  9000|        1934| 43|      10000.0|
|  1251|      hari|    haran|  9100|        1934| 43|      10100.0|
|  1261|      hari|    haran|  9200|        1934| 43|      10200.0|
+------+----------+---------+------+------------+---+-------------+

In [162]:
df6 = df1.withColumn("age_add", age_adder(F.col('age'))).drop('age')

In [163]:
df7 = df1.withColumn("age_add", age_adder(F.col('age'))).drop('age')

In [115]:
df6.show()

+------+----------+---------+------+------------+-------+
|emp_id|first_name|last_name|salary|phone_number|age_add|
+------+----------+---------+------+------------+-------+
|  1234|      hari|    kiran|  2000|        1234|   30.0|
|  1235|      ravi|    kumar|  3000|        1239|   31.0|
|  1236|       sri|  krishna|  5000|        1434|   34.0|
|  1237|     rohit|   sharma|  6000|        1539|   33.0|
|  1238|    suresh|    raina|  8000|       1639]|   49.0|
|  1239|      hari|    haran|  null|        1934|   53.0|
|  1239|      hari|    haran|  9000|        1934|   53.0|
|  1233|      hari|    haran|  9000|        1934|   53.0|
|  1240|      hari|    haran|  9000|        1934|   53.0|
|  1241|      hari|    haran|  9000|        1934|   53.0|
|  1251|      hari|    haran|  9100|        1934|   53.0|
|  1261|      hari|    haran|  9200|        1934|   53.0|
+------+----------+---------+------+------------+-------+

In [110]:
df1.show()

+------+----------+---------+------+------------+---+
|emp_id|first_name|last_name|salary|phone_number|age|
+------+----------+---------+------+------------+---+
|  1234|      hari|    kiran|  2000|        1234| 20|
|  1235|      ravi|    kumar|  3000|        1239| 21|
|  1236|       sri|  krishna|  5000|        1434| 24|
|  1237|     rohit|   sharma|  6000|        1539| 23|
|  1238|    suresh|    raina|  8000|       1639]| 39|
|  1239|      hari|    haran|  null|        1934| 43|
|  1239|      hari|    haran|  9000|        1934| 43|
|  1233|      hari|    haran|  9000|        1934| 43|
|  1240|      hari|    haran|  9000|        1934| 43|
|  1241|      hari|    haran|  9000|        1934| 43|
|  1251|      hari|    haran|  9100|        1934| 43|
|  1261|      hari|    haran|  9200|        1934| 43|
+------+----------+---------+------+------------+---+

In [81]:
df6.repartition(10)

DataFrame[emp_id: string, first_name: string, last_name: string, salary: string, phone_number: string, age_add: double]

In [82]:
df6.coalesce(10)

DataFrame[emp_id: string, first_name: string, last_name: string, salary: string, phone_number: string, age_add: double]

In [83]:
from pyspark.sql.window import Window
from pyspark.sql.functions import row_number

In [84]:
windowSpec  = Window.partitionBy("department").orderBy("salary")

In [157]:
d5.show()

+------+----------+---------+------+------------+---+------+----------+
|emp_id|first_name|last_name|salary|phone_number|age|emp_id|department|
+------+----------+---------+------+------------+---+------+----------+
|  1234|      hari|    kiran|  2000|        1234| 20|  1234|     dept1|
|  1235|      ravi|    kumar|  3000|        1239| 21|  1235|     dept2|
|  1236|       sri|  krishna|  5000|        1434| 24|  1236|     dept1|
|  1237|     rohit|   sharma|  6000|        1539| 23|  1237|     dept2|
|  1238|    suresh|    raina|  8000|       1639]| 39|  1238|     dept1|
|  1239|      hari|    haran|  9000|        1934| 43|  1239|     dept1|
|  1239|      hari|    haran|  null|        1934| 43|  1239|     dept1|
|  1233|      hari|    haran|  9000|        1934| 43|  1233|     dept2|
|  1240|      hari|    haran|  9000|        1934| 43|  1240|     dept1|
|  1241|      hari|    haran|  9000|        1934| 43|  1241|     dept1|
|  1251|      hari|    haran|  9100|        1934| 43|  1251|     dept1|
|  1261|      hari|    haran|  9200|        1934| 43|  1261|     dept1|
+------+----------+---------+------+------------+---+------+----------+

In [85]:
d5.withColumn("row_number",row_number().over(windowSpec)) \
    .show(truncate=False)

+------+----------+---------+------+------------+---+------+----------+----------+
|emp_id|first_name|last_name|salary|phone_number|age|emp_id|department|row_number|
+------+----------+---------+------+------------+---+------+----------+----------+
|1239  |hari      |haran    |null  |1934        |43 |1239  |dept1     |1         |
|1234  |hari      |kiran    |2000  |1234        |20 |1234  |dept1     |2         |
|1236  |sri       |krishna  |5000  |1434        |24 |1236  |dept1     |3         |
|1238  |suresh    |raina    |8000  |1639]       |39 |1238  |dept1     |4         |
|1239  |hari      |haran    |9000  |1934        |43 |1239  |dept1     |5         |
|1240  |hari      |haran    |9000  |1934        |43 |1240  |dept1     |6         |
|1241  |hari      |haran    |9000  |1934        |43 |1241  |dept1     |7         |
|1251  |hari      |haran    |9100  |1934        |43 |1251  |dept1     |8         |
|1261  |hari      |haran    |9200  |1934        |43 |1261  |dept1     |9         |
|1235  |ravi      |kumar    |3000  |1239        |21 |1235  |dept2     |1         |
|1237  |rohit     |sharma   |6000  |1539        |23 |1237  |dept2     |2         |
|1233  |hari      |haran    |9000  |1934        |43 |1233  |dept2     |3         |
+------+----------+---------+------+------------+---+------+----------+----------+

In [158]:


from pyspark.sql.functions import rank
d5.withColumn("rank",rank().over(windowSpec)) \
    .show()

from pyspark.sql.functions import dense_rank
d5.withColumn("dense_rank",dense_rank().over(windowSpec)) \
    .show()

+------+----------+---------+------+------------+---+------+----------+----+
|emp_id|first_name|last_name|salary|phone_number|age|emp_id|department|rank|
+------+----------+---------+------+------------+---+------+----------+----+
|  1239|      hari|    haran|  null|        1934| 43|  1239|     dept1|   1|
|  1234|      hari|    kiran|  2000|        1234| 20|  1234|     dept1|   2|
|  1236|       sri|  krishna|  5000|        1434| 24|  1236|     dept1|   3|
|  1238|    suresh|    raina|  8000|       1639]| 39|  1238|     dept1|   4|
|  1239|      hari|    haran|  9000|        1934| 43|  1239|     dept1|   5|
|  1240|      hari|    haran|  9000|        1934| 43|  1240|     dept1|   5|
|  1241|      hari|    haran|  9000|        1934| 43|  1241|     dept1|   5|
|  1251|      hari|    haran|  9100|        1934| 43|  1251|     dept1|   8|
|  1261|      hari|    haran|  9200|        1934| 43|  1261|     dept1|   9|
|  1235|      ravi|    kumar|  3000|        1239| 21|  1235|     dept2|   1|
|  1237|     rohit|   sharma|  6000|        1539| 23|  1237|     dept2|   2|
|  1233|      hari|    haran|  9000|        1934| 43|  1233|     dept2|   3|
+------+----------+---------+------+------------+---+------+----------+----+

+------+----------+---------+------+------------+---+------+----------+----------+
|emp_id|first_name|last_name|salary|phone_number|age|emp_id|department|dense_rank|
+------+----------+---------+------+------------+---+------+----------+----------+
|  1239|      hari|    haran|  null|        1934| 43|  1239|     dept1|         1|
|  1234|      hari|    kiran|  2000|        1234| 20|  1234|     dept1|         2|
|  1236|       sri|  krishna|  5000|        1434| 24|  1236|     dept1|         3|
|  1238|    suresh|    raina|  8000|       1639]| 39|  1238|     dept1|         4|
|  1239|      hari|    haran|  9000|        1934| 43|  1239|     dept1|         5|
|  1240|      hari|    haran|  9000|        1934| 43|  1240|     dept1|         5|
|  1241|      hari|    haran|  9000|        1934| 43|  1241|     dept1|         5|
|  1251|      hari|    haran|  9100|        1934| 43|  1251|     dept1|         6|
|  1261|      hari|    haran|  9200|        1934| 43|  1261|     dept1|         7|
|  1235|      ravi|    kumar|  3000|        1239| 21|  1235|     dept2|         1|
|  1237|     rohit|   sharma|  6000|        1539| 23|  1237|     dept2|         2|
|  1233|      hari|    haran|  9000|        1934| 43|  1233|     dept2|         3|
+------+----------+---------+------+------------+---+------+----------+----------+

In [156]:
d5_cached = d5.cache()

In [90]:
windowSpecAgg  = Window.partitionBy("department")

In [91]:
from pyspark.sql.functions import col,avg,sum,min,max,row_number 
d5.withColumn("row",row_number().over(windowSpec)) \
  .withColumn("avg", avg(col("salary")).over(windowSpecAgg)) \
  .withColumn("sum", sum(col("salary")).over(windowSpecAgg)) \
  .withColumn("min", min(col("salary")).over(windowSpecAgg)) \
  .withColumn("max", max(col("salary")).over(windowSpecAgg)) \
  .where(col("row")==1).select("department","avg","sum","min","max") \
  .show()

+----------+------+-------+----+----+
|department|   avg|    sum| min| max|
+----------+------+-------+----+----+
|     dept1|7537.5|60300.0|2000|9200|
|     dept2|6000.0|18000.0|3000|9000|
+----------+------+-------+----+----+

## Assignment: Memory profiler